app/controllers/scores_controller.rb

  def index
    @scores = Score.all.limit(10)
---
SELECT  "scores".* FROM "scores" ORDER BY game_score DESC LIMIT $1  [["LIMIT", 10]]

  def create
    @score = Score.new(score_params)

    if @score.save
---
INSERT INTO "scores" ("user_id", "game_score", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 1], ["game_score", 12], ["created_at", 2017-03-02 19:42:03 UTC], ["updated_at", 2017-03-02 19:42:03 UTC]]